    title: Test
    id: 2dcca7b4-4b3a-4db6-9364-a019d54904bf
    name: test_rule
    status: test
    description: This is a test
    references:
        - ref1
        - ref2
    tags:
        - attack.execution
        - attack.t1059
    author: Thomas Patzke
    date: 2020-07-12
    logsource:
        category: process_creation
        product: windows
    detection:
        selection_1:
            Image|endswith: \cmd.exe
            ParentImage|endswith: \svchost.exe
        condition: selection
    fields:
        - User
        - CommandLine
    falsepositives:
        - Everything
    level: medium