title: CodeIntegrity - Unsigned Kernel Module Loaded
id: 951f8d29-1234-1234-1234-0673ff105e6f
status: experimental
description: Detects the presence of a loaded unsigned kernel module on the system.
references:
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-id-explanations
    - https://learn.microsoft.com/en-us/windows/security/threat-protection/windows-defender-application-control/event-tag-explanations
    - Internal Research
author: test
date: 2023-06-06
modified: 2023-12-11
tags:
    - attack.privilege_escalation
logsource:
    product: windows
    service: codeintegrity-operational
detection:
    selection:
        EventID: 1234
    condition: selection
falsepositives:
    - Unlikely
level: high
