    title: Test in Subdirectory
    id: 240dbc26-8b19-4f5f-8972-fc3841f4185f
    status: test
    description: This is another test
    references:
        - ref1
        - ref2
    tags:
        - attack.execution
        - attack.t1059
    author: Thomas Patzke
    date: 2020-07-13
    logsource:
        category: process_creation
        product: windows
    detection:
        selection:
            CommandLine|contains: accepteula
            ParentImage|endswith: svchost.exe
        condition: selection
    fields:
        - User
        - CommandLine
    falsepositives:
        - Everything
    level: high